# Ход ферзя
# Он ходит либо по диагонали(одновременно меняются x, y на одинаковый n), 
# Либо только по x, y (если меняется x, не меняется y и наоборот)

x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input())
#Условие (по диагонали):
if (x2 - x1 == y2 - y1) or (x2 - x1 == y1 - y2) or (x1 - x2 == y1 - y2) or (x1 - x2 == y2 - y1):
    print('YES')
#Если не диагональ, то только вертикаль/горизонталь.
#Условие вертикали/диагонали: Если одна координата меняется (!= 0), то другая ОБЯЗАТЕЛЬНО == 0. 
#это 2 одновременных условия, по этому сделаем их через AND.
#если горизонталь, то X, если вертикаль, то Y. 2 разных условия, оформим через OR.
elif ((x2 - x1 != 0) and (y1 - y2 == 0)) or ((x2 - x1 == 0)) and (y1 - y2 != 0):
    print('YES') #Нас устраивают условия
else:
    print('NO')