a, b = int(input()), int(input())   # Нужно 2 переменные под макс.сумму делителей и под название числа
nindex = 0                          # Индекс числа
tsum = 0                            # Временная сумма
msum = 0                            # Сумма делителей
for i in range(a, b + 1):           # ДЛЯ КАЖДОГО ЧИСЛА ИЗ ОТРЕЗКА

    for j in range(1, i + 1):       # ДЛЯ КАЖДОГО ДЕЛИТЕЛЯ ЧИСЛА (!!!) Сначала вписал range(a, i + 1), но это ошибка: ДЕЛИТЕЛИ ДОЛЖНЫ СЧИТАТЬСЯ С 1!
        if i % j == 0:              # Если число имеет делитель 
            tsum += j               # Ко временной сумме прибавляется делитель

                                    # ---Цикл прокручивается, пока все делители числа(Включая его самого), не проверятся---
    
    if tsum >= msum:                # Если временная сумма > Максимально известной суммы (!!!) Это должно же проверяться ПОСЛЕ ВСЕХ итераций делителя. А я в него вставлял. (!!!) - Сначала строгий знак > ставил. Так нельзя. В условии сказано: Если две одинаковых макс.суммы, то вставляем ту, у которой индекс больше. 
        msum = tsum                 # Максимальная сумма присваивает значение временной
        nindex = i                  # Числом с максимально известной суммой делителей называется это число.
    tsum = 0                        # Обнуляем временную сумму. (!!!) Сначала обнулял сумму ТОЛЬКО если tsum > msum. а нужно было обновлять ВСЕГДА после делителя. Короче, отступ не тот был.

                                    # Цикл выбора числа из отрезка делает шаг. Теперь рассматриваются все варианты-делители следующего числа

print(nindex, msum)                 # После проверки всех чисел выписываем число с максимальным индексом и максимальную сумму делителей.